Revit 2026 API

# ExportLinetypeTableRemove Method

---

Removes the pair (key, info) corresponding to the given ExportLinetypeKey.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void Remove(
	ExportLinetypeKey exportLinetypeKey
)
```
```vb
Public Sub Remove (
	exportLinetypeKey As ExportLinetypeKey
)
```
```cpp
public:
void Remove(
	ExportLinetypeKey^ exportLinetypeKey
)
```
```fsharp
member Remove :
        exportLinetypeKey : ExportLinetypeKey -> unit
```

#### Parameters

exportLinetypeKey ExportLinetypeKey
     The export line type key

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

#### Reference

ExportLinetypeTable Class

Autodesk.Revit.DB Namespace